## Terraform Plan (Staging)
```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.cloud_run.google_cloud_run_v2_service.api will be created
  + resource "google_cloud_run_v2_service" "api" {
      + conditions              = (known after apply)
      + create_time             = (known after apply)
      + creator                 = (known after apply)
      + delete_time             = (known after apply)
      + deletion_protection     = true
      + effective_annotations   = (known after apply)
      + effective_labels        = {
          + "cost-center"                = "engineering"
          + "environment"                = "staging"
          + "goog-terraform-provisioned" = "true"
          + "hipaa"                      = "ready"
          + "managed-by"                 = "terraform"
        }
      + etag                    = (known after apply)
      + expire_time             = (known after apply)
      + generation              = (known after apply)
      + id                      = (known after apply)
      + ingress                 = (known after apply)
      + labels                  = {
          + "cost-center" = "engineering"
          + "environment" = "staging"
          + "hipaa"       = "ready"
          + "managed-by"  = "terraform"
        }
      + last_modifier           = (known after apply)
      + latest_created_revision = (known after apply)
      + latest_ready_revision   = (known after apply)
      + launch_stage            = (known after apply)
      + location                = "us-central1"
      + name                    = "adyela-api-staging"
      + observed_generation     = (known after apply)
      + project                 = "adyela-staging"
      + reconciling             = (known after apply)
      + terminal_condition      = (known after apply)
      + terraform_labels        = {
          + "cost-center"                = "engineering"
          + "environment"                = "staging"
          + "goog-terraform-provisioned" = "true"
          + "hipaa"                      = "ready"
          + "managed-by"                 = "terraform"
        }
      + traffic_statuses        = (known after apply)
      + uid                     = (known after apply)
      + update_time             = (known after apply)
      + uri                     = (known after apply)
      + urls                    = (known after apply)

      + template {
          + annotations                      = {
              + "run.googleapis.com/ingress" = "internal"
            }
          + max_instance_request_concurrency = (known after apply)
          + service_account                  = "adyela-staging-hipaa@adyela-staging.iam.gserviceaccount.com"
          + timeout                          = (known after apply)

          + containers {
              + build_info = (known after apply)
              + image      = "us-central1-docker.pkg.dev/adyela-staging/adyela/adyela-api-staging:latest"

              + env {
                  + name  = "AUDIT_LOGGING"
                  + value = "true"
                }
              + env {
                  + name  = "DATABASE_URL"
                    # (1 unchanged attribute hidden)

                  + value_source {
                      + secret_key_ref {
                          + secret  = "database-connection-string"
                          + version = "latest"
                        }
                    }
                }
              + env {
                  + name  = "DATA_ENCRYPTION"
                  + value = "true"
                }
              + env {
                  + name  = "ENCRYPTION_KEY"
                    # (1 unchanged attribute hidden)

                  + value_source {
                      + secret_key_ref {
                          + secret  = "encryption-key"
                          + version = "latest"
                        }
                    }
                }
              + env {
                  + name  = "ENVIRONMENT"
                  + value = "staging"
                }
              + env {
                  + name  = "EXTERNAL_API_KEYS"
                    # (1 unchanged attribute hidden)

                  + value_source {
                      + secret_key_ref {
                          + secret  = "external-api-keys"
                          + version = "latest"
                        }
                    }
                }
              + env {
                  + name  = "FIREBASE_ADMIN_KEY"
                    # (1 unchanged attribute hidden)

                  + value_source {
                      + secret_key_ref {
                          + secret  = "firebase-admin-key"
                          + version = "latest"
                        }
                    }
                }
              + env {
                  + name  = "FIREBASE_PROJECT_ID"
                    # (1 unchanged attribute hidden)

                  + value_source {
                      + secret_key_ref {
                          + secret  = "firebase-project-id"
                          + version = "latest"
                        }
                    }
                }
              + env {
                  + name  = "GCP_PROJECT_ID"
                  + value = "adyela-staging"
                }
              + env {
                  + name  = "HIPAA_COMPLIANCE"
                  + value = "true"
                }
              + env {
                  + name  = "JWT_SECRET"
                    # (1 unchanged attribute hidden)

                  + value_source {
                      + secret_key_ref {
                          + secret  = "jwt-secret-key"
                          + version = "latest"
                        }
                    }
                }
              + env {
                  + name  = "SECRET_KEY"
                    # (1 unchanged attribute hidden)

                  + value_source {
                      + secret_key_ref {
                          + secret  = "api-secret-key"
                          + version = "latest"
                        }
                    }
                }
              + env {
                  + name  = "SMTP_CREDENTIALS"
                    # (1 unchanged attribute hidden)

                  + value_source {
                      + secret_key_ref {
                          + secret  = "smtp-credentials"
                          + version = "latest"
                        }
                    }
                }
              + env {
                  + name  = "VERSION"
                  + value = "latest"
                }

              + ports {
                  + container_port = 8080
                  + name           = (known after apply)
                }

              + resources {
                  + limits = {
                      + "cpu"    = "1"
                      + "memory" = "512Mi"
                    }
                }

              + startup_probe (known after apply)
            }

          + scaling {
              + max_instance_count = 2
              + min_instance_count = 0
            }

          + vpc_access {
              + connector = "adyela-staging-connector"
              + egress    = "PRIVATE_RANGES_ONLY"
            }
        }

      + traffic {
          + percent = 100
          + type    = "TRAFFIC_TARGET_ALLOCATION_TYPE_LATEST"
        }
    }

  # module.cloud_run.google_cloud_run_v2_service.web will be created
  + resource "google_cloud_run_v2_service" "web" {
      + conditions              = (known after apply)
      + create_time             = (known after apply)
      + creator                 = (known after apply)
      + delete_time             = (known after apply)
      + deletion_protection     = true
      + effective_annotations   = (known after apply)
      + effective_labels        = {
          + "cost-center"                = "engineering"
          + "environment"                = "staging"
          + "goog-terraform-provisioned" = "true"
          + "hipaa"                      = "ready"
          + "managed-by"                 = "terraform"
        }
      + etag                    = (known after apply)
      + expire_time             = (known after apply)
      + generation              = (known after apply)
      + id                      = (known after apply)
      + ingress                 = (known after apply)
      + labels                  = {
          + "cost-center" = "engineering"
          + "environment" = "staging"
          + "hipaa"       = "ready"
          + "managed-by"  = "terraform"
        }
      + last_modifier           = (known after apply)
      + latest_created_revision = (known after apply)
      + latest_ready_revision   = (known after apply)
      + launch_stage            = (known after apply)
      + location                = "us-central1"
      + name                    = "adyela-web-staging"
      + observed_generation     = (known after apply)
      + project                 = "adyela-staging"
      + reconciling             = (known after apply)
      + terminal_condition      = (known after apply)
      + terraform_labels        = {
          + "cost-center"                = "engineering"
          + "environment"                = "staging"
          + "goog-terraform-provisioned" = "true"
          + "hipaa"                      = "ready"
          + "managed-by"                 = "terraform"
        }
      + traffic_statuses        = (known after apply)
      + uid                     = (known after apply)
      + update_time             = (known after apply)
      + uri                     = (known after apply)
      + urls                    = (known after apply)

      + template {
          + annotations                      = {
              + "run.googleapis.com/ingress" = "internal-and-cloud-load-balancing"
            }
          + max_instance_request_concurrency = (known after apply)
          + service_account                  = "adyela-staging-hipaa@adyela-staging.iam.gserviceaccount.com"
          + timeout                          = (known after apply)

          + containers {
              + build_info = (known after apply)
              + image      = "us-central1-docker.pkg.dev/adyela-staging/adyela/adyela-web-staging:latest"

              + env {
                  + name  = "AUDIT_LOGGING"
                  + value = "true"
                }
              + env {
                  + name  = "HIPAA_COMPLIANCE"
                  + value = "true"
                }
              + env {
                  + name  = "VERSION"
                  + value = "latest"
                }
              + env {
                  + name  = "VITE_ENV"
                  + value = "staging"
                }

              + ports {
                  + container_port = 8080
                  + name           = (known after apply)
                }

              + resources {
                  + limits = {
                      + "cpu"    = "1"
                      + "memory" = "256Mi"
                    }
                }

              + startup_probe (known after apply)
            }

          + scaling {
              + max_instance_count = 2
              + min_instance_count = 0
            }

          + vpc_access {
              + connector = "adyela-staging-connector"
              + egress    = "PRIVATE_RANGES_ONLY"
            }
        }

      + traffic {
          + percent = 100
          + type    = "TRAFFIC_TARGET_ALLOCATION_TYPE_LATEST"
        }
    }

  # module.service_account.google_project_iam_member.artifact_registry_reader will be created
  + resource "google_project_iam_member" "artifact_registry_reader" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:adyela-staging-hipaa@adyela-staging.iam.gserviceaccount.com"
      + project = "adyela-staging"
      + role    = "roles/artifactregistry.reader"
    }

  # module.service_account.google_project_iam_member.cloudsql_client will be created
  + resource "google_project_iam_member" "cloudsql_client" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:adyela-staging-hipaa@adyela-staging.iam.gserviceaccount.com"
      + project = "adyela-staging"
      + role    = "roles/cloudsql.client"
    }

  # module.service_account.google_project_iam_member.datastore_user will be created
  + resource "google_project_iam_member" "datastore_user" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:adyela-staging-hipaa@adyela-staging.iam.gserviceaccount.com"
      + project = "adyela-staging"
      + role    = "roles/datastore.user"
    }

  # module.service_account.google_project_iam_member.logging_writer will be created
  + resource "google_project_iam_member" "logging_writer" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:adyela-staging-hipaa@adyela-staging.iam.gserviceaccount.com"
      + project = "adyela-staging"
      + role    = "roles/logging.logWriter"
    }

  # module.service_account.google_project_iam_member.run_admin will be created
  + resource "google_project_iam_member" "run_admin" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:adyela-staging-hipaa@adyela-staging.iam.gserviceaccount.com"
      + project = "adyela-staging"
      + role    = "roles/run.admin"
    }

  # module.service_account.google_project_iam_member.secret_accessor will be created
  + resource "google_project_iam_member" "secret_accessor" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:adyela-staging-hipaa@adyela-staging.iam.gserviceaccount.com"
      + project = "adyela-staging"
      + role    = "roles/secretmanager.secretAccessor"
    }

  # module.service_account.google_project_iam_member.storage_object_viewer will be created
  + resource "google_project_iam_member" "storage_object_viewer" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:adyela-staging-hipaa@adyela-staging.iam.gserviceaccount.com"
      + project = "adyela-staging"
      + role    = "roles/storage.objectViewer"
    }

  # module.service_account.google_service_account.hipaa will be created
  + resource "google_service_account" "hipaa" {
      + account_id   = "adyela-staging-hipaa"
      + description  = "Dedicated service account for HIPAA-compliant staging deployments"
      + disabled     = false
      + display_name = "Adyela Staging HIPAA Service Account"
      + email        = "adyela-staging-hipaa@adyela-staging.iam.gserviceaccount.com"
      + id           = (known after apply)
      + member       = "serviceAccount:adyela-staging-hipaa@adyela-staging.iam.gserviceaccount.com"
      + name         = (known after apply)
      + project      = "adyela-staging"
      + unique_id    = (known after apply)
    }

  # module.vpc.google_compute_firewall.allow_health_checks will be created
  + resource "google_compute_firewall" "allow_health_checks" {
      + creation_timestamp = (known after apply)
      + description        = "Allow health checks from Google Load Balancers"
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "adyela-staging-vpc-allow-health-checks"
      + network            = "adyela-staging-vpc"
      + priority           = 1000
      + project            = "adyela-staging"
      + self_link          = (known after apply)
      + source_ranges      = [
          + "130.211.0.0/22",
          + "35.191.0.0/16",
        ]

      + allow {
          + ports    = [
              + "80",
              + "443",
              + "8000",
              + "8080",
            ]
          + protocol = "tcp"
        }
    }

  # module.vpc.google_compute_firewall.allow_iap_ssh will be created
  + resource "google_compute_firewall" "allow_iap_ssh" {
      + creation_timestamp = (known after apply)
      + description        = "Allow SSH from Identity-Aware Proxy"
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "adyela-staging-vpc-allow-iap-ssh"
      + network            = "adyela-staging-vpc"
      + priority           = 1000
      + project            = "adyela-staging"
      + self_link          = (known after apply)
      + source_ranges      = [
          + "35.235.240.0/20",
        ]

      + allow {
          + ports    = [
              + "22",
            ]
          + protocol = "tcp"
        }
    }

  # module.vpc.google_compute_firewall.allow_internal will be created
  + resource "google_compute_firewall" "allow_internal" {
      + creation_timestamp = (known after apply)
      + description        = "Allow all internal traffic within VPC"
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "adyela-staging-vpc-allow-internal"
      + network            = "adyela-staging-vpc"
      + priority           = 1000
      + project            = "adyela-staging"
      + self_link          = (known after apply)
      + source_ranges      = [
          + "10.0.0.0/24",
        ]

      + allow {
          + ports    = [
              + "0-65535",
            ]
          + protocol = "tcp"
        }
      + allow {
          + ports    = [
              + "0-65535",
            ]
          + protocol = "udp"
        }
      + allow {
          + ports    = []
          + protocol = "icmp"
        }
    }

  # module.vpc.google_compute_firewall.deny_all_ingress will be created
  + resource "google_compute_firewall" "deny_all_ingress" {
      + creation_timestamp = (known after apply)
      + description        = "Deny all ingress traffic by default"
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "adyela-staging-vpc-deny-all-ingress"
      + network            = "adyela-staging-vpc"
      + priority           = 65534
      + project            = "adyela-staging"
      + self_link          = (known after apply)
      + source_ranges      = [
          + "0.0.0.0/0",
        ]

      + deny {
          + ports    = []
          + protocol = "all"
        }
    }

  # module.vpc.google_compute_network.vpc will be created
  + resource "google_compute_network" "vpc" {
      + auto_create_subnetworks                   = false
      + bgp_always_compare_med                    = (known after apply)
      + bgp_best_path_selection_mode              = (known after apply)
      + bgp_inter_region_cost                     = (known after apply)
      + delete_default_routes_on_create           = false
      + description                               = "VPC for staging environment - HIPAA compliant"
      + gateway_ipv4                              = (known after apply)
      + id                                        = (known after apply)
      + internal_ipv6_range                       = (known after apply)
      + mtu                                       = (known after apply)
      + name                                      = "adyela-staging-vpc"
      + network_firewall_policy_enforcement_order = "AFTER_CLASSIC_FIREWALL"
      + network_id                                = (known after apply)
      + numeric_id                                = (known after apply)
      + project                                   = "adyela-staging"
      + routing_mode                              = "REGIONAL"
      + self_link                                 = (known after apply)
    }

  # module.vpc.google_compute_subnetwork.private_subnet will be created
  + resource "google_compute_subnetwork" "private_subnet" {
      + creation_timestamp         = (known after apply)
      + description                = "Private subnet for staging - HIPAA compliant"
      + enable_flow_logs           = (known after apply)
      + external_ipv6_prefix       = (known after apply)
      + fingerprint                = (known after apply)
      + gateway_address            = (known after apply)
      + id                         = (known after apply)
      + internal_ipv6_prefix       = (known after apply)
      + ip_cidr_range              = "10.0.0.0/24"
      + ipv6_cidr_range            = (known after apply)
      + ipv6_gce_endpoint          = (known after apply)
      + name                       = "adyela-staging-vpc-private-us-central1"
      + network                    = (known after apply)
      + private_ip_google_access   = true
      + private_ipv6_google_access = (known after apply)
      + project                    = "adyela-staging"
      + purpose                    = (known after apply)
      + region                     = "us-central1"
      + self_link                  = (known after apply)
      + stack_type                 = (known after apply)
      + state                      = (known after apply)
      + subnetwork_id              = (known after apply)

      + log_config {
          + aggregation_interval = "INTERVAL_5_SEC"
          + filter_expr          = "true"
          + flow_sampling        = 0.5
          + metadata             = "INCLUDE_ALL_METADATA"
        }

      + secondary_ip_range (known after apply)
    }

  # module.vpc.google_vpc_access_connector.connector will be created
  + resource "google_vpc_access_connector" "connector" {
      + connected_projects = (known after apply)
      + id                 = (known after apply)
      + machine_type       = "f1-micro"
      + max_instances      = 3
      + max_throughput     = (known after apply)
      + min_instances      = 2
      + min_throughput     = (known after apply)
      + name               = "adyela-staging-connector"
      + network            = (known after apply)
      + project            = "adyela-staging"
      + region             = "us-central1"
      + self_link          = (known after apply)
      + state              = (known after apply)

      + subnet {
          + name       = "adyela-staging-connector-subnet"
          + project_id = "adyela-staging"
        }
    }

Plan: 17 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + api_service_name            = "adyela-api-staging"
  + api_service_url             = (known after apply)
  + hipaa_service_account_email = "adyela-staging-hipaa@adyela-staging.iam.gserviceaccount.com"
  + hipaa_service_account_id    = (known after apply)
  + subnet_name                 = "adyela-staging-vpc-private-us-central1"
  + vpc_connector_name          = "adyela-staging-connector"
  + vpc_network_name            = "adyela-staging-vpc"
  + web_service_name            = "adyela-web-staging"
  + web_service_url             = (known after apply)

```